DataProcessors/РасшЕГАИС_ЗагрузкаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>РасшЕГАИС_ЗагрузкаНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РасшЕГАИС_ЗагрузкаНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	   ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтаФорма);
		НачатьПомещениеФайла(ОписаниеОповещения,,ПутьКФайлу,Ложь,УникальныйИдентификатор);
КонецПроцедуры
		
&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	РасширениеФайла =ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ВыбранноеИмяФайла);
	ЗагрузитьФайлНаСервере(Адрес, РасширениеФайла);
КонецПроцедуры 

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Фильтр = "(*.xls)|*.xls|(*.xlsx)|*.xlsx";
	ДиалогВыбора.Фильтр = Фильтр;
	ДиалогВыбора.Заголовок = "Выберите файл";
	Если ДиалогВыбора.Выбрать() Тогда		
		ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ЗагрузитьФайлНаСервере(Адрес, РасширениеФайла)
	//Получение данных из временного хранилища
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	// Получение имени временного файла
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	// Сохранение данных во временный файл
	Данные.Записать(ИмяВременногоФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);

	ОбластьФайла = ТабличныйДокумент.ПолучитьОбласть(ТабличныйДокумент.Области[0].Имя);
	КолВоСтрокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
	КолВоКолонокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НомерСтроки"		, Новый ОписаниеТипов("Число")									, "№", 4);
	ТаблицаРезультат.Колонки.Добавить("Наименование"	, Новый ОписаниеТипов("Строка")									, "Наименование");
	ТаблицаРезультат.Колонки.Добавить("СтавкаНДС"		, Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС")			, "Ставка НДС");
	ТаблицаРезультат.Колонки.Добавить("Штрихкод"		, Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)), "Штрихкод");
	ТаблицаРезультат.Колонки.Добавить("КодАП"			, Новый ОписаниеТипов("Строка")									, "Код АП");
	ТаблицаРезультат.Колонки.Добавить("КодВЕТИС"		, Новый ОписаниеТипов("Строка")									, "Код ВЕТИС");
	ТаблицаРезультат.Колонки.Добавить("Номенклатура"	, Новый ОписаниеТипов("СправочникСсылка.Номенклатура")			, "Номенклатура");
	Для нСтрокаТФ = 2 ПО КолВоСтрокФайла Цикл
		НС = ТаблицаРезультат.Добавить();
		НС.НомерСтроки 	= Число(ТабличныйДокумент.Область(нСтрокаТФ,1).Текст);
		НС.Наименование = ТабличныйДокумент.Область(нСтрокаТФ,2).Текст;
		НС.Штрихкод 	= ТабличныйДокумент.Область(нСтрокаТФ,3).Текст;
		НС.КодАП 		= ТабличныйДокумент.Область(нСтрокаТФ,4).Текст;
		НС.КодВЕТИС 	= ТабличныйДокумент.Область(нСтрокаТФ,5).Текст;
	КонецЦикла;
	
	ОбработкаЗагрузки(ТаблицаРезультат);
	Попытка											
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;					

КонецПроцедуры

&НаСервере
Функция ОбработкаЗагрузки(ТЗ)
	ТЗ = СопоставлениеСНоменклатурой(ТЗ);
	ПодготовкаДанных.Загрузить(ТЗ);
	//ПроверкаНаДубли(ТЗ);
	//ОбработкаЕГАИС(ТЗ);
	//ОбработкаВЕТИС(ТЗ);
КонецФункции

&НаСервере
Функция СопоставлениеСНоменклатурой(ТЗ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	тз.НомерСтроки КАК НомерСтроки,
	                      |	тз.Наименование КАК Наименование,
	                      |	Выразить(тз.Штрихкод как Строка(20)) КАК Штрихкод,
	                      |	тз.КодАП КАК КодАП,
	                      |	тз.КодВЕТИС КАК КодВЕТИС
	                      |ПОМЕСТИТЬ Файл
	                      |ИЗ
	                      |	&тз КАК тз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Файл.НомерСтроки КАК НомерСтроки,
	                      |	Файл.Наименование КАК Наименование,
	                      |	Файл.Штрихкод КАК Штрихкод,
	                      |	Файл.КодАП КАК КодАП,
	                      |	Файл.КодВЕТИС КАК КодВЕТИС,
	                      |	Штрихкоды.Владелец КАК Номенклатура
	                      |ИЗ
	                      |	Файл КАК Файл
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	                      |		ПО Файл.Штрихкод = Штрихкоды.Штрихкод");
	Запрос.УстановитьПараметр("тз",ТЗ);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;		
КонецФункции

&НаСервере
Функция УдалениеПроверкаНаДубли(ТЗ)
	
	
КонецФункции

&НаСервере
Функция ОбработкаЕГАИС(ТЗ)
		
КонецФункции

&НаСервере
Функция ОбработкаВЕТИС(ТЗ)
		
КонецФункции
